**Pandas Serisi Oluşturmak**

In [5]:
import pandas as pd

In [6]:
pd.Series([100,25,36,50,88])

0    100
1     25
2     36
3     50
4     88
dtype: int64

In [7]:
seri=pd.Series([100,25,36,50,88])

In [8]:
type(seri)

pandas.core.series.Series

In [9]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [10]:
seri.size

5

In [11]:

seri.ndim

1

In [12]:
seri.values

array([100,  25,  36,  50,  88], dtype=int64)

In [13]:
seri.head()

0    100
1     25
2     36
3     50
4     88
dtype: int64

In [14]:
seri.tail()

0    100
1     25
2     36
3     50
4     88
dtype: int64

index isimlendirmesi

In [15]:
pd.Series([99,22,332,94,5], index=[1,3,5,7,9])

1     99
3     22
5    332
7     94
9      5
dtype: int64

In [16]:
pd.Series([99,22,332,94,5], index=["a","b","c","d","e"])

a     99
b     22
c    332
d     94
e      5
dtype: int64

In [17]:
seri=pd.Series([99,22,332,94,5], index=["a","b","c","d","e"])

In [18]:
seri["a"]

99

In [19]:
seri["a":"c"]

a     99
b     22
c    332
dtype: int64

sözlük üzerinden liste oluşturmak

In [20]:
sozluk = pd.Series({"reg":10, "log":11, "cart":12})

In [21]:
sozluk

reg     10
log     11
cart    12
dtype: int64

In [22]:
sozluk = {"reg":10, "log":11, "cart":12}

In [23]:
seri=pd.Series(sozluk)

In [24]:
seri

reg     10
log     11
cart    12
dtype: int64

iki seriyi birleştirerek seri oluşturma

In [25]:
pd.concat([seri,seri])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

**Serilerde Eleman İşlemleri**

In [26]:
import numpy as np
a=np.array([1,2,33,444,75])
seri=pd.Series(a)
seri

0      1
1      2
2     33
3    444
4     75
dtype: int32

In [27]:
seri[0]

1

In [28]:
seri[0:3]

0     1
1     2
2    33
dtype: int32

In [29]:
seri = pd.Series([99,20,78,75], index= ["reg","log","cart","rf"])

In [30]:
seri

reg     99
log     20
cart    78
rf      75
dtype: int64

In [31]:
seri.index

Index(['reg', 'log', 'cart', 'rf'], dtype='object')

In [32]:
seri.keys

<bound method Series.keys of reg     99
log     20
cart    78
rf      75
dtype: int64>

In [33]:
list(seri.items()) #key-value şeklinde gelmesini istiyorsak

[('reg', 99), ('log', 20), ('cart', 78), ('rf', 75)]

Eleman Sorgulama

In [34]:
"reg" in seri

True

In [35]:
"a" in seri

False

In [36]:
seri["reg"]

99

In [37]:
#fancy eleman

In [38]:
seri[["rf","reg"]]

rf     75
reg    99
dtype: int64

In [39]:
#yeniden atama ile "reg" değerini değiştirme

In [51]:
seri["reg"]=130

In [52]:
seri

reg     130
log      20
cart     78
rf       75
dtype: int64

In [53]:
seri["reg":"log"]

reg    130
log     20
dtype: int64

**PANDAS DataFrame OLUŞTURMA**

In [54]:
 import pandas as pd

In [55]:
l=[1,2,39,67,90]
l

[1, 2, 39, 67, 90]

In [58]:
import numpy as np
m=np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [59]:
pd.DataFrame(m,columns = ["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [60]:
#df isimlendirme

In [61]:
df=pd.DataFrame(m,columns = ["var1","var2","var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [62]:
df.columns= ("deg1","deg2","deg3")
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [63]:
type(df)

pandas.core.frame.DataFrame

In [64]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [65]:
df.shape

(3, 3)

In [66]:
df.ndim

2

In [67]:
df.size

9

In [68]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [69]:
type(df.values)

numpy.ndarray

In [71]:
df.head()

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [72]:
df.tail()

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [73]:
a=np.array([1,2,3,4,5])

In [74]:
pd.DataFrame(a,columns=["deg1"])

   deg1
0     1
1     2
2     3
3     4
4     5

**Pandas DataRame Eleman İşlemleri**

In [75]:
import numpy as np
s1 =np.random.randint(10,size=5)
s2 =np.random.randint(10,size=5)
s3 =np.random.randint(10,size=5)

In [79]:
#sozluk uzerinden bir DataFrame oluşturma

In [80]:
sozluk =  {"var1":s1,"var2":s2,"var3":s3 }
sozluk

{'var1': array([6, 3, 0, 0, 9]),
 'var2': array([8, 1, 1, 9, 4]),
 'var3': array([2, 3, 7, 4, 8])}

In [81]:
df =pd.DataFrame(sozluk)

In [82]:
df

   var1  var2  var3
0     6     8     2
1     3     1     3
2     0     1     7
3     0     9     4
4     9     4     8

In [83]:
df[0:1]

   var1  var2  var3
0     6     8     2

In [84]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [85]:
df.index=["a","b","c","d","e"]

In [86]:
df

   var1  var2  var3
a     6     8     2
b     3     1     3
c     0     1     7
d     0     9     4
e     9     4     8

In [87]:
df["c":"e"]

   var1  var2  var3
c     0     1     7
d     0     9     4
e     9     4     8

In [88]:
#silme işlemi

In [90]:
df.drop("a",axis=0)

   var1  var2  var3
b     3     1     3
c     0     1     7
d     0     9     4
e     9     4     8

In [91]:
df

   var1  var2  var3
a     6     8     2
b     3     1     3
c     0     1     7
d     0     9     4
e     9     4     8

drop ile "a" silindiğinde df kısmında bir değişiklik olmadı. Yeni şekli ile "a" silinmiş halde olması için inplace=True argümanını kullanırız.

In [93]:
df.drop("a",axis=0 , inplace = True)
df

   var1  var2  var3
b     3     1     3
c     0     1     7
d     0     9     4
e     9     4     8

In [94]:
#fancy ile silme

In [95]:
l = ["c","e"]

In [96]:
df.drop(l,axis=0)

   var1  var2  var3
b     3     1     3
d     0     9     4

In [99]:
#degiskenler icin, l içindeki her bir elemanın df içinde var mı sorgulama

In [100]:
"var1" in df

True

In [103]:
l = ["var1","var2", "var5"]

In [104]:
for i in l:
    print(i in df)

True
True
False

In [105]:
df

   var1  var2  var3
b     3     1     3
c     0     1     7
d     0     9     4
e     9     4     8

In [106]:
#"var4" isimli değişkeni "var1" * "var2" ile oluşturma

In [118]:
df["var4"] = df["var1"] * df["var2"]

In [119]:
df

   var1  var2  var3  var4
b     3     1     3     3
c     0     1     7     0
d     0     9     4     0
e     9     4     8    36

In [120]:
#değisken silme

In [121]:
df.drop("var4", axis=1)

   var1  var2  var3
b     3     1     3
c     0     1     7
d     0     9     4
e     9     4     8

df

In [123]:
df.drop("var4", axis=1, inplace= True)
df

   var1  var2  var3
b     3     1     3
c     0     1     7
d     0     9     4
e     9     4     8

In [124]:
l = ["var1","var2"]

In [125]:
df.drop(l, axis=1 )

   var3
b     3
c     7
d     4
e     8

**Gözlem ve Değişken Seçimi: loc&iloc**

In [128]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size=(10,3))
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df

   var1  var2  var3
0     1    25    12
1    23     7     1
2    20    12    14
3     5    13    17
4     9    11     3
5    22    18    17
6    22    22     1
7    11    25    14
8     4    17    21
9    12    26    14

In [129]:
#loc: tanımlandığı şekli ile seçim yapmak için kullanılır.

In [130]:
df.loc[0:3]

   var1  var2  var3
0     1    25    12
1    23     7     1
2    20    12    14
3     5    13    17

In [131]:
#iloc: alışık olduğumuz indeksleme mantığı ile seçim yapar.

In [132]:
df.iloc[0:3]

   var1  var2  var3
0     1    25    12
1    23     7     1
2    20    12    14

In [133]:
df.iloc[0,0]

1

In [134]:
df.iloc[:3,:2]

   var1  var2
0     1    25
1    23     7
2    20    12

In [135]:
df.loc[0:3,"var3"]

0    12
1     1
2    14
3    17
Name: var3, dtype: int32

In [136]:
df.iloc[0:3] ["var3"]

0    12
1     1
2    14
Name: var3, dtype: int32

!!!! Eğer verilen kurallara bağlı bir şekilde seçim yapılma ihtiyacı varsa gözlem ya da değişken isimlendirmeleri açısından loc yapısı kullanılır. Ya da klasik index yapısı ile seçim yapılmak isteniyorsa iloc kullanılır. Özetle eğer verilen kurallara göre seçim yapılma işlemi varsa gözlem ya da
değisken isimlendirmeleri açısından "loc" yapısı kullanır.Eğer verilen isimlendirmelerden bağımsız ben bunlara takılmıyorum klasik index mantığıyla seçim yapmak istiyorum dersek de "iloc" kullanılır

** Koşullu Eleman İşlemleri**

In [41]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size=(10,3))
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df

   var1  var2  var3
0    18    12     9
1    16    12    17
2     8    22    13
3    26     3     8
4     5     1    17
5    22    22    25
6    21     9    25
7     8    19     1
8    10    17     5
9    16     3     3

In [42]:
df["var1"]

0    18
1    16
2     8
3    26
4     5
5    22
6    21
7     8
8    10
9    16
Name: var1, dtype: int32

In [43]:
df.iloc[0:,]["var3"]

0     9
1    17
2    13
3     8
4    17
5    25
6    25
7     1
8     5
9     3
Name: var3, dtype: int32

In [44]:
df

   var1  var2  var3
0    18    12     9
1    16    12    17
2     8    22    13
3    26     3     8
4     5     1    17
5    22    22    25
6    21     9    25
7     8    19     1
8    10    17     5
9    16     3     3

In [45]:
df[0:2] [["var1","var2"]]

   var1  var2
0    18    12
1    16    12

In [46]:
df[df.var1 > 15]["var1"]

0    18
1    16
3    26
5    22
6    21
9    16
Name: var1, dtype: int32

In [47]:
df[(df.var1>15) & (df.var2<1)]

Empty DataFrame
Columns: [var1, var2, var3]
Index: []

In [48]:
df.loc[(df.var1>15), ["var1","var2"]]

   var1  var2
0    18    12
1    16    12
3    26     3
5    22    22
6    21     9
9    16     3

In [49]:
df[(df.var1>15)] [["var1","var2"]] #loc kullanmadak yapmak istersek

   var1  var2
0    18    12
1    16    12
3    26     3
5    22    22
6    21     9
9    16     3

# Birleştirme (Join) İşlemleri

In [50]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (5,3))
df1 = pd.DataFrame(m, columns = ["var1","var2","var3"])
df1

   var1  var2  var3
0     8     3     4
1    13    27    13
2    17    23    24
3    14    24     6
4    29    17    12

In [51]:
df2 = df1 + 99

In [52]:
df2

   var1  var2  var3
0   107   102   103
1   112   126   112
2   116   122   123
3   113   123   105
4   128   116   111

In [53]:
pd.concat([df1,df2])

   var1  var2  var3
0     8     3     4
1    13    27    13
2    17    23    24
3    14    24     6
4    29    17    12
0   107   102   103
1   112   126   112
2   116   122   123
3   113   123   105
4   128   116   111

In [54]:
pd.concat([df1, df2], ignore_index = True)

   var1  var2  var3
0     8     3     4
1    13    27    13
2    17    23    24
3    14    24     6
4    29    17    12
5   107   102   103
6   112   126   112
7   116   122   123
8   113   123   105
9   128   116   111

In [55]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [56]:
df2.columns = ["var1","var2","deg3"]
df2.columns

Index(['var1', 'var2', 'deg3'], dtype='object')

In [57]:
pd.concat([df1,df2])

   var1  var2  var3   deg3
0     8     3   4.0    NaN
1    13    27  13.0    NaN
2    17    23  24.0    NaN
3    14    24   6.0    NaN
4    29    17  12.0    NaN
0   107   102   NaN  103.0
1   112   126   NaN  112.0
2   116   122   NaN  123.0
3   113   123   NaN  105.0
4   128   116   NaN  111.0

In [58]:
pd.concat([df1,df2], join = "inner") #kesisimlerini getirdi

   var1  var2
0     8     3
1    13    27
2    17    23
3    14    24
4    29    17
0   107   102
1   112   126
2   116   122
3   113   123
4   128   116

In [60]:
pd.concat([df1, df2], join_axes = [df2.columns], ignore_index =True)

TypeError: concat() got an unexpected keyword argument 'join_axes'

# İleri Birleştirme İşlemleri

In [62]:
import pandas as pd

In [63]:
#birebir birleştirme

In [67]:
df1 = pd.DataFrame({'calisanlar': ['Fatma','Gül','Adem','Zeynep'],
                   'grup':['Muhasebe','Muhendislik','Muhendislik','İK']})
df1

  calisanlar         grup
0      Fatma     Muhasebe
1        Gül  Muhendislik
2       Adem  Muhendislik
3     Zeynep           İK

In [66]:
df2 = pd.DataFrame({'calisanlar': ['Fatma','Gül','Adem','Zeynep'],
                   'ilk_giris': [2010,2009,2014,2019]})
df2

  calisanlar  ilk_giris
0      Fatma       2010
1        Gül       2009
2       Adem       2014
3     Zeynep       2019

In [68]:
pd.merge(df1, df2)

  calisanlar         grup  ilk_giris
0      Fatma     Muhasebe       2010
1        Gül  Muhendislik       2009
2       Adem  Muhendislik       2014
3     Zeynep           İK       2019

In [69]:
pd.merge(df1, df2, on = 'calisanlar')

  calisanlar         grup  ilk_giris
0      Fatma     Muhasebe       2010
1        Gül  Muhendislik       2009
2       Adem  Muhendislik       2014
3     Zeynep           İK       2019

In [70]:
#çoktan teke

In [71]:
df3 = pd.merge(df1, df2)
df3

  calisanlar         grup  ilk_giris
0      Fatma     Muhasebe       2010
1        Gül  Muhendislik       2009
2       Adem  Muhendislik       2014
3     Zeynep           İK       2019

In [72]:
df4 = pd.DataFrame({'grup':['Mühendislik','Tıp','İK'],
                   'mudur': ['Ceyda','Bugra','Huseyin']})
df4

          grup    mudur
0  Mühendislik    Ceyda
1          Tıp    Bugra
2           İK  Huseyin

In [73]:
pd.merge(df3, df4)

  calisanlar grup  ilk_giris    mudur
0     Zeynep   İK       2019  Huseyin

In [74]:
#çoktan çoka

In [75]:
df5 = pd.DataFrame({'grup': ['Muhasebe','Muhasebe','Muhendislik','IK','İK','Muhendislik'],
                   'yetenekler': ['matematik','excel','kodlama','excel','yönetim','linux']})
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3           IK      excel
4           İK    yönetim
5  Muhendislik      linux

In [76]:
df1

  calisanlar         grup
0      Fatma     Muhasebe
1        Gül  Muhendislik
2       Adem  Muhendislik
3     Zeynep           İK

In [77]:
pd.merge(df1, df5)

  calisanlar         grup yetenekler
0      Fatma     Muhasebe  matematik
1      Fatma     Muhasebe      excel
2        Gül  Muhendislik    kodlama
3        Gül  Muhendislik      linux
4       Adem  Muhendislik    kodlama
5       Adem  Muhendislik      linux
6     Zeynep           İK    yönetim

# Toplulaştırma ve Gruplama (Aggregation & Grouping)

In [78]:
import seaborn as sns

In [79]:
df = sns.load_dataset("planets")
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [80]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [81]:
df.shape

(1035, 6)

In [82]:
df.count()

method            1035
number            1035
orbital_period     992
mass               513
distance           808
year              1035
dtype: int64

In [83]:
df["mass"].mean()

2.6381605847953233

In [84]:
df["mass"].count()

513

In [85]:
df["mass"].max()

25.0

In [86]:
df["mass"].min()

0.0036

In [87]:
df["mass"].std()

3.8186166509616046

In [88]:
df["mass"].sum()

1353.37638

In [89]:
df["mass"].var()

14.58183312700122

In [91]:
df.describe() #describe: tek tek ele almak yerine bir arada hepsini görmek istiyorsak

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [92]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [93]:
df.dropna().describe().T 
#dropna(): eksik değerleri ele almadan hesapla

#T: Transpozunu al demek

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

# Gruplama İşlemleri

In [94]:
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                  'veri': ['11','17','23','55','43','77']},columns = ['gruplar','veri'])
df

  gruplar veri
0       A   11
1       B   17
2       C   23
3       A   55
4       B   43
5       C   77

In [95]:
df.groupby("gruplar")

In [96]:
df.groupby("gruplar").mean()

           veri
gruplar
A         577.5
B         871.5
C        1188.5

In [97]:
df.groupby("gruplar").sum()

         veri
gruplar
A        1155
B        1743
C        2377

In [98]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [99]:
df.groupby("method")

In [100]:
df.groupby("method")["orbital_period"].sum()

method
Astrometry                       1.262360e+03
Eclipse Timing Variations        4.276480e+04
Imaging                          1.418973e+06
Microlensing                     2.207500e+04
Orbital Brightness Modulation    2.127920e+00
Pulsar Timing                    3.671511e+04
Pulsation Timing Variations      1.170000e+03
Radial Velocity                  4.553151e+05
Transit                          8.377523e+03
Transit Timing Variations        2.393505e+02
Name: orbital_period, dtype: float64

In [101]:
df.groupby("method")["mass"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Eclipse Timing Variations,2.0,5.125000,1.308148,4.2000,4.66250,5.125,5.5875,6.05
Imaging,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Microlensing,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Orbital Brightness Modulation,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Pulsar Timing,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Pulsation Timing Variations,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Radial Velocity,510.0,2.630699,3.825883,0.0036,0.22525,1.260,3.0000,25.00
Transit,1.0,1.470000,NaN,1.4700,1.47000,1.470,1.4700,1.47
Transit Timing Variations,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

# İleri Toplulaştırma İşlemleri (Aggregate, filter, transform, apply)

In [102]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                  'degisken1': [10,23,33,22,11,99],
                  'degisken2': [100,456,856,368,456,369]},
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        456
2       C         33        856
3       A         22        368
4       B         11        456
5       C         99        369

**Aggregate**

In [105]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A             16.0      234.0
B             17.0      456.0
C             66.0      612.5

In [104]:
df.groupby("gruplar").aggregate([min, np.median,max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   16.0  22       100  234.0  368
B              11   17.0  23       456  456.0  456
C              33   66.0  99       369  612.5  856

In [106]:
df.groupby("gruplar").aggregate({"degisken1": "min", "degisken2" : "max"})

         degisken1  degisken2
gruplar
A               10        368
B               11        456
C               33        856

**filter**

In [107]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                  'degisken1': [10,23,33,22,11,99],
                  'degisken2': [100,456,856,368,456,369]},
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        456
2       C         33        856
3       A         22        368
4       B         11        456
5       C         99        369

In [108]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [109]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         8.485281  189.504617
B         8.485281    0.000000
C        46.669048  344.361002

In [110]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        856
5       C         99        369

**Transform**

In [111]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                  'degisken1': [10,23,33,22,11,99],
                  'degisken2': [100,456,856,368,456,369]},
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        456
2       C         33        856
3       A         22        368
4       B         11        456
5       C         99        369

In [112]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                  'degisken1': [10,23,33,22,11,99],
                  'degisken2': [100,456,856,368,456,369]},
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        456
2       C         33        856
3       A         22        368
4       B         11        456
5       C         99        369

In [113]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                  'degisken1': [10,23,33,22,11,99],
                  'degisken2': [100,456,856,368,456,369]},
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        456
2       C         33        856
3       A         22        368
4       B         11        456
5       C         99        369

In [114]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                  'degisken1': [10,23,33,22,11,99],
                  'degisken2': [100,456,856,368,456,369]},
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        456
2       C         33        856
3       A         22        368
4       B         11        456
5       C         99        369

In [115]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                  'degisken1': [10,23,33,22,11,99],
                  'degisken2': [100,456,856,368,456,369]},
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        456
2       C         33        856
3       A         22        368
4       B         11        456
5       C         99        369

In [116]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                  'degisken1': [10,23,33,22,11,99],
                  'degisken2': [100,456,856,368,456,369]},
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        456
2       C         33        856
3       A         22        368
4       B         11        456
5       C         99        369

In [117]:
df["degisken1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [118]:
df_a = df.iloc[:, 1:3]
df_a.transform(lambda x: x-x.mean() /x.std()) #lambda: bir fonk isimlendirmesi yapmadan fonk oluşturmaya yarar

   degisken1   degisken2
0   9.013055   98.225121
1  22.013055  454.225121
2  32.013055  854.225121
3  21.013055  366.225121
4  10.013055  454.225121
5  98.013055  367.225121

**Apply**

Tıpkı transform fonk ve filter fonk gibi dataframein değişkenlerin üzerinde gezinme yeteneği olan ve toplulaştırma amacıyla kullanılabilcek fonksiyondur.

In [119]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
                  'degisken1': [10,23,33,22,11,99],
                  'degisken2': [100,456,856,368,456,369]},
                 columns = ['degisken1','degisken2'])
df

   degisken1  degisken2
0         10        100
1         23        456
2         33        856
3         22        368
4         11        456
5         99        369

In [120]:
df.apply(np.sum)

degisken1     198
degisken2    2605
dtype: int64

In [121]:
df.apply(np.sum)

degisken1     198
degisken2    2605
dtype: int64

In [122]:
df.apply(np.mean)

degisken1     33.000000
degisken2    434.166667
dtype: float64

In [123]:
#aynı işlemi grup bazında yapsaydık nasıl olurdu

In [126]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                  'degisken1': [10,23,33,22,11,99],
                  'degisken2': [100,456,856,368,456,369]},
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        456
2       C         33        856
3       A         22        368
4       B         11        456
5       C         99        369

In [127]:
df.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        468
B            BB         34        912
C            CC        132       1225

In [128]:
df.groupby("gruplar").apply(np.mean)

C:\Users\fatma\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3438: FutureWarning: In a future version, DataFrame.mean(axis=None) will return a scalar mean over the entire DataFrame. To retain the old behavior, use 'frame.mean(axis=0)' or just 'frame.mean()'
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
C:\Users\fatma\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3438: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)

         degisken1  degisken2
gruplar
A             16.0      234.0
B             17.0      456.0
C             66.0      612.5

# Pivot Tablolar

In [129]:
#groupby'ın çok boyutlu versiyonu olarak düşünülebilir

In [130]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [131]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [132]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack() ##unstack(): hiyerarşik index yapısını çözmek için kullanılır

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [133]:
#unstack() kullanmadan elde edilen çıktı

In [134]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

**pivot ile table**

In [136]:
titanic.pivot_table("survived", index = "sex", columns = "class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [137]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [139]:
age = pd.cut(titanic["age"], [0,18,90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 90]]

In [140]:
titanic.pivot_table("survived", ["sex", age], "class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663